tap "brotherbui/homebrew"
tap "daipeihust/tap"
tap "homebrew/core"
tap "nextdns/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "samtay/tui"
tap "sst/tap"
brew "autoenv"
brew "awscli"
brew "bat"
brew "bottom"
brew "unbound", restart_service: :changed
brew "cask", link: false
brew "clamav"
brew "clang-format"
brew "php", restart_service: :changed
brew "composer"
brew "ctags"
brew "deno"
brew "entr"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "google-java-format"
brew "gradle"
brew "grip"
brew "hugo"
brew "iproute2mac"
brew "jdtls"
brew "jq"
brew "libiconv"
brew "lua-language-server"
brew "maven"
brew "mysql-client"
brew "neovim"
brew "nginx", restart_service: :changed
brew "php@8.2", restart_service: :changed
brew "php@8.3"
brew "pipx"
brew "ripgrep"
brew "sd"
brew "shfmt"
brew "stow"
brew "the_silver_searcher"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "wp-cli"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "brotherbui/homebrew/fshare"
brew "brotherbui/homebrew/sapp"
brew "daipeihust/tap/im-select"
brew "nextdns/tap/nextdns"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
# GUI casks moved to homebrew/Brewfile.gui layer for optional install.
vscode "aaron-bond.better-comments"
vscode "afnizarnur.framer-snippets-vscode"
vscode "ahmadawais.shades-of-purple"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anbuselvanrocky.bootstrap5-vscode"
vscode "andys8.jest-snippets"
vscode "angular.ng-template"
vscode "attilabuti.vscode-mjml"
vscode "augment.vscode-augment"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.phpserver"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dailywebcoding.dwc-snippets"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "evondev.dracula-high-contrast"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "gerane.theme-peacocks-in-space"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "heybourn.headwind"
vscode "htmlhint.vscode-htmlhint"
vscode "humao.rest-client"
vscode "infeng.vscode-react-typescript"
vscode "jhipster-ide.jdl"
vscode "jock.svg"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mkloubert.vscode-http-client"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ngekngok.vscode-custom-snippets"
vscode "njpwerner.autodocstring"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "pucelle.vscode-css-navigation"
vscode "rapidapi.vscode-services"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "roerohan.mongo-snippets-for-node-js"
vscode "rvest.vs-code-prettier-eslint"
vscode "shopify.polaris-for-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "thekalinga.bootstrap4-vscode"
vscode "timheuer.jsondbg"
vscode "tyriar.lorem-ipsum"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "wcwhitehead.bootstrap-3-snippets"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "zignd.html-css-class-completion"
